xuyoulai/Tidm-02012/src_board/hal.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/boards/TMDSCNCD2800157" --context "system" --product "C2000WARE@5.02.00.00"
 * @versions {"tool":"1.15.0+2826"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc         = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1        = adc.addInstance();
const adc2        = adc.addInstance();
const analog      = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1     = analog.addInstance();
const asysctl     = scripting.addModule("/driverlib/asysctl.js");
const led         = scripting.addModule("/driverlib/board_components/led", {}, false);
const led1        = led.addInstance();
const cmpss       = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1      = cmpss.addInstance();
const cmpss_lite  = scripting.addModule("/driverlib/cmpss_lite.js", {}, false);
const cmpss_lite1 = cmpss_lite.addInstance();
const cputimer    = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1   = cputimer.addInstance();
const epwm        = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1       = epwm.addInstance();
const epwm2       = epwm.addInstance();
const epwm3       = epwm.addInstance();
const epwmxbar    = scripting.addModule("/driverlib/epwmxbar.js", {}, false);
const epwmxbar1   = epwmxbar.addInstance();
const gpio        = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1       = gpio.addInstance();
const gpio2       = gpio.addInstance();
const gpio3       = gpio.addInstance();
const inputxbar   = scripting.addModule("/driverlib/inputxbar.js", {}, false);
const inputxbar1  = inputxbar.addInstance();
const mcan        = scripting.addModule("/driverlib/mcan.js", {}, false);
const mcan1       = mcan.addInstance();
const spi         = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1        = spi.addInstance();
const sysctl      = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.soc1Trigger              = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2Trigger              = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2SampleWindow         = 20;
adc1.$name                    = "MTR1_ADCA";
adc1.soc0Trigger              = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1SampleWindow         = 20;
adc1.enabledInts              = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1         = true;
adc1.registerInterrupts       = ["1"];
adc1.socHighPriorityMode      = "ADC_PRI_THRU_SOC1_HIPRI";
adc1.soc1IndependentNameMode  = true;
adc1.soc2IndependentNameMode  = true;
adc1.ppb1IndependentNameMode  = true;
adc1.soc0IndependentNameMode  = true;
adc1.adcClockPrescaler        = "ADC_CLK_DIV_2_0";
adc1.soc0Name                 = "MTR1_IU_SOC";
adc1.soc0Channel              = "ADC_CH_ADCIN2";
adc1.enabledSOCs              = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc1.soc0SampleWindow         = 15;
adc1.soc1Name                 = "MTR1_IV_SOC";
adc1.soc2Name                 = "MTR1_VU_SOC";
adc1.soc2Channel              = "ADC_CH_ADCIN3";
adc1.soc3IndependentNameMode  = true;
adc1.soc3Channel              = "ADC_CH_ADCIN8";
adc1.soc3Trigger              = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3SampleWindow         = 20;
adc1.interrupt1SOCSource      = "ADC_SOC_NUMBER3";
adc1.enabledPPBs              = ["ADC_PPB_NUMBER1","ADC_PPB_NUMBER2"];
adc1.ppb1Name                 = "MTR1_IU_PPB";
adc1.ppb2Name                 = "MTR1_IV_PPB";
adc1.ppb2SOCNumber            = "ADC_SOC_NUMBER1";
adc1.soc1Channel              = "ADC_CH_ADCIN15";
adc1.ppb2IndependentNameMode  = true;
adc1.soc3Name                 = "MTR1_VDC_SOC";
adc1.adcInt1.enableInterrupt  = true;
adc1.adcInt1.interruptHandler = "motor1CtrlISR";

adc2.adcBase                 = "ADCC_BASE";
adc2.socHighPriorityMode     = "ADC_PRI_THRU_SOC1_HIPRI";
adc2.enabledPPBs             = ["ADC_PPB_NUMBER1"];
adc2.soc1Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc2Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc2SampleWindow        = 20;
adc2.$name                   = "MTR1_ADCC";
adc2.registerInterrupts      = ["1"];
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc1SampleWindow        = 20;
adc2.useInterrupts           = false;
adc2.soc1Name                = "MTR1_VV_SOC";
adc2.soc0IndependentNameMode = true;
adc2.soc1IndependentNameMode = true;
adc2.ppb1IndependentNameMode = true;
adc2.adcClockPrescaler       = "ADC_CLK_DIV_2_0";
adc2.soc0Name                = "MTR1_IW_SOC";
adc2.soc0Channel             = "ADC_CH_ADCIN14";
adc2.soc0SampleWindow        = 15;
adc2.soc1Channel             = "ADC_CH_ADCIN6";
adc2.soc2Name                = "MTR1_VW_SOC";
adc2.soc2IndependentNameMode = true;
adc2.soc2Channel             = "ADC_CH_ADCIN2";
adc2.ppb1Name                = "MTR1_IW_PPB";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];

asysctl.analogReference         = "INTERNAL";
asysctl.analogReferenceVoltage  = "1P65";
asysctl.enableTemperatureSensor = true;

led1.$hardware              = system.deviceData.board.components.D2;
led1.$name                  = "LED2";
led1.gpio.writeInitialValue = true;
led1.gpio.initialValue      = 1;
led1.gpio.$name             = "GPIO_LED2";
led1.gpio.gpioPin.$assign   = "hsecDigital.96";

cmpss1.enableModule         = true;
cmpss1.initFilterHigh       = true;
cmpss1.clearFilterLatchHigh = true;
cmpss1.samplePrescaleHigh   = 32;
cmpss1.sampleWindowHigh     = 32;
cmpss1.thresholdHigh        = 30;
cmpss1.initFilterLow        = true;
cmpss1.clearFilterLatchLow  = true;
cmpss1.samplePrescaleLow    = 32;
cmpss1.sampleWindowLow      = 32;
cmpss1.thresholdLow         = 30;
cmpss1.highCTRIPOUT         = "CMPSS_TRIPOUT_FILTER";
cmpss1.highCTRIP            = "CMPSS_TRIP_FILTER";
cmpss1.lowCTRIPOUT          = "CMPSS_TRIPOUT_FILTER";
cmpss1.lowCTRIP             = "CMPSS_TRIP_FILTER";
cmpss1.lowCompInvert        = true;
cmpss1.hysteresisVal        = "1";
cmpss1.dacValHigh           = 3584;
cmpss1.dacValLow            = 512;
cmpss1.asysCMPHNMXSELValue  = "0";
cmpss1.asysCMPLNMXSELValue  = "0";
cmpss1.$name                = "MTR1_CMPSS_IU_IV";
cmpss1.asysCMPLPMXSELValue  = "3";
cmpss1.cmpssHighName        = "MTR1_CMPSS_IU";
cmpss1.cmpssLowName         = "MTR1_CMPSS_IV";

