xuyoulai/Tidm-02012/src_board/hal.syscfg
epwm3.epwmTripZone_oneShotSource                                      = ["EPWM_TZ_SIGNAL_DCAEVT1","EPWM_TZ_SIGNAL_DCBEVT1"];
epwm3.epwmTripZone_cbcSource                                          = ["EPWM_TZ_SIGNAL_CBC6"];
epwm3.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_eventSync   = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm3.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_1_eventSync   = "EPWM_DC_EVENT_INPUT_NOT_SYNCED";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCAH_combinationInputConfig     = ["EPWM_DC_COMBINATIONAL_TRIPIN7"];
epwm3.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_A1                         = "EPWM_TZ_EVENT_DCXH_HIGH";
epwm3.epwmDigitalCompare_EPWM_DC_MODULE_A_EPWM_DC_EVENT_1_eventSource = "EPWM_DC_EVENT_SOURCE_FILT_SIGNAL";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCBH_combinationInputConfig     = ["EPWM_DC_COMBINATIONAL_TRIPIN7"];
epwm3.epwmDigitalCompare_EPWM_TZ_DC_OUTPUT_B1                         = "EPWM_TZ_EVENT_DCXL_HIGH";
epwm3.epwmDigitalCompare_EPWM_DC_MODULE_B_EPWM_DC_EVENT_1_eventSource = "EPWM_DC_EVENT_SOURCE_FILT_SIGNAL";
epwm3.epwmTimebase_counterModeAfterSync                               = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm3.hrpwm_syncSource                                                = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode                 = true;
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZA                           = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTripZone_EPWM_TZ_ACTION_EVENT_TZB                           = "EPWM_TZ_ACTION_LOW";
epwm3.epwmTimebase_emulationMode                                      = "EPWM_EMULATION_FREE_RUN";
epwm3.epwmTimebase_hsClockDiv                                         = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_counterMode                                        = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode                 = true;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO           = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_PERIOD         = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA        = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA      = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmDeadband_polarityFED                                        = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.epwmDeadband_enableRED                                          = true;
epwm3.epwmDeadband_delayRED                                           = 10;
epwm3.epwmDeadband_enableFED                                          = true;
epwm3.epwmDeadband_delayFED                                           = 10;
epwm3.$name                                                           = "MTR1_PWM_W";
epwm3.useCase                                                         = "CUSTOM";
epwm3.useInterfacePins                                                = ["EPWM#_A","EPWM#_B"];
epwm3.copyUse                                                         = true;
epwm3.copyFrom                                                        = "MTR1_PWM_U";
epwm3.codeTemplateName                                                = "";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCAH                            = "EPWM_DC_TRIP_COMBINATION";
epwm3.epwmDigitalCompare_EPWM_DC_TYPE_DCBH                            = "EPWM_DC_TRIP_COMBINATION";
epwm3.epwm.$assign                                                    = "EPWM3";
epwm3.epwm.epwm_aPin.$assign                                          = "hsecDigital.50";
epwm3.epwm.epwm_bPin.$assign                                          = "hsecDigital.52";
epwm3.aQual.$name                                                     = "myGPIOQUAL4";
epwm3.bQual.$name                                                     = "myGPIOQUAL5";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM3 on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", epwm3.epwm, "epwm_aPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM3 on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", epwm3.epwm, "epwm_bPin");

epwmxbar1.tripInput       = "XBAR_TRIP7";
epwmxbar1.mux0Config      = "XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L";
epwmxbar1.$name           = "MTR1_IS_XBAR_EPWM_MUX";
epwmxbar1.mux2Config      = "XBAR_EPWM_MUX02_CMPSS2_CTRIPH_OR_L";
epwmxbar1.mux4Config      = "XBAR_EPWM_MUX04_CMPSS3_CTRIPH_OR_L";
epwmxbar1.useSourceSelect = true;
epwmxbar1.sourceSignals   = ["CMPSS1_CTRIPH_OR_L","CMPSS2_CTRIPH_OR_L"];

gpio1.writeInitialValue = true;
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.$name             = "GPIO_SYS_DIS_FET_SUPPLY";
gpio1.gpioPin.$assign   = "hsecDigital.56";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM4 on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio1, "gpioPin");

gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.$name           = "GPIO_SYS_WDOG_OUT";
gpio2.gpioPin.$assign = "hsecDigital.69";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to SPIA on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio2, "gpioPin");

gpio3.direction       = "GPIO_DIR_MODE_OUT";
gpio3.$name           = "GPIO_SYS_WDOG_DIS";
gpio3.gpioPin.$assign = "hsecDigital.67";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to SPIA on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", gpio3, "gpioPin");

inputxbar1.$name = "MTR1_XBAR_INPUT1";

mcan1.loopbackMode            = false;
mcan1.nomRatePrescalar        = 3;
mcan1.nomTimeSeg1             = 9;
mcan1.nomTimeSeg2             = 8;
mcan1.nomSynchJumpWidth       = 8;
mcan1.dataRatePrescalar       = 1;
mcan1.dataTimeSeg1            = 9;
mcan1.dataTimeSeg2            = 8;
mcan1.dataSynchJumpWidth      = 8;
mcan1.enableInterrupt         = true;
mcan1.interruptFlags          = ["MCAN_INTR_MASK_ALL"];
mcan1.interruptLine           = ["MCAN_INTR_LINE_NUM_0"];
mcan1.interruptLine0Flag      = ["MCAN_INTR_MASK_ALL"];
mcan1.$name                   = "MCAN_COM";
mcan1.txBufElemSize           = "MCAN_ELEM_SIZE_8BYTES";
mcan1.rxFIFO0size             = 1;
mcan1.txBufNum                = 1;
mcan1.rxBufElemSize           = "MCAN_ELEM_SIZE_8BYTES";
mcan1.rxFIFO0ElemSize         = "MCAN_ELEM_SIZE_8BYTES";
mcan1.rxFIFO1ElemSize         = "MCAN_ELEM_SIZE_8BYTES";
mcan1.rxFIFO1size             = 0;
mcan1.txEventFIFOWaterMark    = 0;
mcan1.txEventFIFOStartAddr    = 0;
mcan1.txEventFIFOSize         = 0;
mcan1.tdcConfig_tdcf          = 0;
mcan1.tdcConfig_tdco          = 0;
mcan1.wdcPreload              = 0;
mcan1.lse                     = 0;
mcan1.flesa                   = 0;
mcan1.mcan.$assign            = "MCAN";
mcan1.mcan.mcan_rxPin.$assign = "hsecDigital.80";
mcan1.mcan.mcan_txPin.$assign = "hsecDigital.82";
mcan1.rxQual.$name            = "myGPIOQUAL6";
mcan1.txQual.$name            = "myGPIOQUAL7";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to CANA on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", mcan1.mcan, "mcan_rxPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to CANA on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", mcan1.mcan, "mcan_txPin");

spi1.$name                   = "DAC128S_SPI";
spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi1.bitRate                 = 1500000;
spi1.txFifo                  = "SPI_FIFO_TX4";
spi1.rxFifo                  = "SPI_FIFO_RX4";
spi1.spi.$assign             = "SPIA";
spi1.spi.spi_picoPin.$assign = "hsecDigital.57";
spi1.spi.spi_pociPin.$assign = "hsecDigital.61";
spi1.spi.spi_clkPin.$assign  = "hsecDigital.59";
spi1.spi.spi_ptePin.$assign  = "hsecDigital.63";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM5 on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", spi1.spi, "spi_picoPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM6 ALT on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", spi1.spi, "spi_pociPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM5 on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", spi1.spi, "spi_clkPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to EPWM6 ALT on the Control Card F2800157\\. Consider selecting it in 'use hardware' above\\. @@@.+?@@@", spi1.spi, "spi_ptePin");

sysctl.enable_SYSCTL_PERIPH_CLK_PMBUSA = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EPG1   = false;
sysctl.enableMCD                       = true;
sysctl.enable_SYSCTL_PERIPH_CLK_HRCAL  = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EQEP1  = false;
sysctl.enable_SYSCTL_PERIPH_CLK_EQEP2  = false;
sysctl.enable_SYSCTL_PERIPH_CLK_I2CA   = false;
sysctl.enable_SYSCTL_PERIPH_CLK_I2CB   = false;
sysctl.enable_SYSCTL_PERIPH_CLK_CANA   = false;
